Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cq.c
/*
 * mcxnex_cq_free()
 *    Context: Can be called only from user or kernel context.
 */
/* ARGSUSED */
int
mcxnex_cq_free(mcxnex_state_t *state, mcxnex_cqhdl_t *cqhdl, uint_t sleepflag)
{
	mcxnex_rsrc_t		*cqc, *rsrc;
	mcxnex_umap_db_entry_t	*umapdb;
	mcxnex_hw_cqc_t		cqc_entry;
	mcxnex_pdhdl_t		pd;
	mcxnex_mrhdl_t		mr;
	mcxnex_cqhdl_t		cq, resize;
	uint32_t		cqnum;
	uint64_t		value;
	uint_t			maxprot;
	int			status;

	/*
	 * Pull all the necessary information from the Mcxnex Completion Queue
	 * handle.  This is necessary here because the resource for the
	 * CQ handle is going to be freed up as part of this operation.
	 */
	cq	= *cqhdl;
	mutex_enter(&cq->cq_lock);
	cqc	= cq->cq_cqcrsrcp;
	rsrc	= cq->cq_rsrcp;
	pd	= state->hs_pdhdl_internal;
	mr	= cq->cq_mrhdl;
	cqnum	= cq->cq_cqnum;

	resize = cq->cq_resize_hdl;		/* save the handle for later */

	/*
	 * If there are work queues still associated with the CQ, then return
	 * an error.  Otherwise, we will be holding the CQ lock.
	 */
	if (cq->cq_refcnt != 0) {
		mutex_exit(&cq->cq_lock);
		return (IBT_CQ_BUSY);
	}

	/*
	 * If this was a user-mappable CQ, then we need to remove its entry
	 * from the "userland resources database".  If it is also currently
	 * mmap()'d out to a user process, then we need to call
	 * devmap_devmem_remap() to remap the CQ memory to an invalid mapping.
	 * We also need to invalidate the CQ tracking information for the
	 * user mapping.
	 */
	if (cq->cq_is_umap) {
		status = mcxnex_umap_db_find(state->hs_instance, cqnum,
		    MLNX_UMAP_CQMEM_RSRC, &value, MCXNEX_UMAP_DB_REMOVE,
		    &umapdb);
		if (status != DDI_SUCCESS) {
			mutex_exit(&cq->cq_lock);
			MCXNEX_WARNING(state, "failed to find in database");
			return (DDI_FAILURE);
		}
		mcxnex_umap_db_free(umapdb);
		if (cq->cq_umap_dhp != NULL) {
			maxprot = (PROT_READ | PROT_WRITE | PROT_USER);
			status = devmap_devmem_remap(cq->cq_umap_dhp,
			    state->hs_dip, 0, 0, cq->cq_cqinfo.qa_size,
			    maxprot, DEVMAP_MAPPING_INVALID, NULL);
			if (status != DDI_SUCCESS) {
				mutex_exit(&cq->cq_lock);
				MCXNEX_WARNING(state, "failed in CQ memory "
				    "devmap_devmem_remap()");
				return (DDI_FAILURE);
			}
			cq->cq_umap_dhp = (devmap_cookie_t)NULL;
		}
	}

	/*
	 * Put NULL into the Arbel CQNum-to-CQHdl list.  This will allow any
	 * in-progress events to detect that the CQ corresponding to this
	 * number has been freed.
	 */
	state->hs_cqhdl[cqc->hr_indx] = NULL;

	mutex_exit(&cq->cq_lock);
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*cq))

	/*
	 * Reclaim CQC entry from hardware (using the Mcxnex HW2SW_CQ
	 * firmware command).  If the ownership transfer fails for any reason,
	 * then it is an indication that something (either in HW or SW) has
	 * gone seriously wrong.
	 */
	status = mcxnex_cmn_ownership_cmd_post(state, HW2SW_CQ, &cqc_entry,
	    sizeof (mcxnex_hw_cqc_t), cqnum, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		MCXNEX_WARNING(state, "failed to reclaim CQC ownership");
		cmn_err(CE_CONT, "Mcxnex: HW2SW_CQ command failed: %08x\n",
		    status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		return (DDI_FAILURE);
	}

	/*
	 * From here on, we start reliquishing resources - but check to see
	 * if a resize was in progress - if so, we need to relinquish those
	 * resources as well
	 */


	/*
	 * Deregister the memory for the Completion Queue.  If this fails
	 * for any reason, then it is an indication that something (either
	 * in HW or SW) has gone seriously wrong.  So we print a warning
	 * message and return.
	 */
	status = mcxnex_mr_deregister(state, &mr, MCXNEX_MR_DEREG_ALL,
	    sleepflag);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to deregister CQ memory");
		return (DDI_FAILURE);
	}

	if (resize)	{	/* there was a pointer to a handle */
		mr = resize->cq_mrhdl;	/* reuse the pointer to the region */
		status = mcxnex_mr_deregister(state, &mr, MCXNEX_MR_DEREG_ALL,
		    sleepflag);
		if (status != DDI_SUCCESS) {
			MCXNEX_WARNING(state, "failed to deregister resize CQ "
			    "memory");
			return (DDI_FAILURE);
		}
	}

	/* Free the memory for the CQ */
	mcxnex_queue_free(&cq->cq_cqinfo);
	if (resize)	{
		mcxnex_queue_free(&resize->cq_cqinfo);
		/* and the temporary handle */
		kmem_free(resize, sizeof (struct mcxnex_sw_cq_s));
	}

	/* everything else does not matter for the resize in progress */

	/* Free the dbr */
	mcxnex_dbr_free(state, cq->cq_uarpg, cq->cq_arm_ci_vdbr);

	/* Free the Mcxnex Completion Queue handle */
	mcxnex_rsrc_free(state, &rsrc);

	/* Free up the CQC entry resource */
	mcxnex_rsrc_free(state, &cqc);

	/* Decrement the reference count on the protection domain (PD) */
	mcxnex_pd_refcnt_dec(pd);

	/* Set the cqhdl pointer to NULL and return success */
	*cqhdl = NULL;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_cq_resize()
 *    Context: Can be called only from user or kernel context.
 */
int
mcxnex_cq_resize(mcxnex_state_t *state, mcxnex_cqhdl_t cq, uint_t req_size,
    uint_t *actual_size, uint_t sleepflag)
{
	mcxnex_hw_cqc_t		cqc_entry;
	mcxnex_cqhdl_t		resize_hdl;
	mcxnex_qalloc_info_t	new_cqinfo;
	ibt_mr_attr_t		mr_attr;
	mcxnex_mr_options_t	op;
	mcxnex_pdhdl_t		pd;
	mcxnex_mrhdl_t		mr;
	mcxnex_hw_cqe_t		*buf;
	uint32_t		new_prod_indx;
	uint_t			log_cq_size;
	int			status, flag;

	if (cq->cq_resize_hdl != 0) {	/* already in process */
		status = IBT_CQ_BUSY;
		goto cqresize_fail;
	}


	/* Use the internal protection domain (PD) for CQs */
	pd = state->hs_pdhdl_internal;

	/*
	 * Calculate the appropriate size for the new resized completion queue.
	 * Note:  All Mcxnex CQs must be a power-of-2 minus 1 in size.  Also
	 * they may not be any smaller than MCXNEX_CQ_MIN_SIZE.  This step is
	 * to round the requested size up to the next highest power-of-2
	 */
	req_size = max(req_size, MCXNEX_CQ_MIN_SIZE);
	log_cq_size = highbit(req_size);

	/*
	 * Next we verify that the rounded-up size is valid (i.e. consistent
	 * with the device limits and/or software-configured limits)
	 */
	if (log_cq_size > state->hs_cfg_profile->cp_log_max_cq_sz) {
		status = IBT_HCA_CQ_EXCEEDED;
		goto cqresize_fail;
	}

