Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cq.c
/*
 *	cmd_sn must be initialized to 1 to enable proper reenabling
 *	by mcxnex_arm_cq_dbr_update().
 */
static void
mcxnex_arm_cq_dbr_init(mcxnex_dbr_t *cq_arm_dbr)
{
	uint32_t *target;

	target = (uint32_t *)cq_arm_dbr + 1;
	*target = htonl(1 << MCXNEX_CQDB_CMDSN_SHIFT);
}


/*
 *	User cmd_sn needs help from this kernel function to know
 *	when it should be incremented (modulo 4).  We do an atomic
 *	update of the arm_cq dbr to communicate this fact.  We retry
 *	in the case that user library is racing with us.  We zero
 *	out the cmd field so that the user library can use the cmd
 *	field to track the last command it issued (solicited verses any).
 */
static void
mcxnex_arm_cq_dbr_update(mcxnex_dbr_t *cq_arm_dbr)
{
	uint32_t tmp, cmp, new;
	uint32_t old_cmd_sn, new_cmd_sn;
	uint32_t *target;
	int retries = 0;

	target = (uint32_t *)cq_arm_dbr + 1;
retry:
	cmp = *target;
	tmp = htonl(cmp);
	old_cmd_sn = tmp & (0x3 << MCXNEX_CQDB_CMDSN_SHIFT);
	new_cmd_sn = (old_cmd_sn + (0x1 << MCXNEX_CQDB_CMDSN_SHIFT)) &
	    (0x3 << MCXNEX_CQDB_CMDSN_SHIFT);
	new = htonl((tmp & ~(0x37 << MCXNEX_CQDB_CMD_SHIFT)) | new_cmd_sn);
	tmp = atomic_cas_32(target, cmp, new);
	if (tmp != cmp) {	/* cas failed, so need to retry */
		drv_usecwait(retries & 0xff);   /* avoid race */
		if (++retries > 100000) {
			cmn_err(CE_CONT, "cas failed in mcxnex\n");
			retries = 0;
		}
		goto retry;
	}
}


/*
 * mcxnex_cq_handler()
 *    Context: Only called from interrupt context
 */
int
mcxnex_cq_handler(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe)
{
	mcxnex_cqhdl_t		cq;
	uint_t			cqnum;
	uint_t			eqe_evttype;

	eqe_evttype = MCXNEX_EQE_EVTTYPE_GET(eq, eqe);

	ASSERT(eqe_evttype == MCXNEX_EVT_COMPLETION ||
	    eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW);

	if (eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW) {
		mcxnex_eq_overflow_handler(state, eq, eqe);
		return (DDI_FAILURE);
	}

	/* Get the CQ handle from CQ number in event descriptor */
	cqnum = MCXNEX_EQE_CQNUM_GET(eq, eqe);
	cq = mcxnex_cqhdl_from_cqnum(state, cqnum);

	/*
	 * If the CQ handle is NULL, this is probably an indication
	 * that the CQ has been freed already.  In which case, we
	 * should not deliver this event.
	 *
	 * We also check that the CQ number in the handle is the
	 * same as the CQ number in the event queue entry.  This
	 * extra check allows us to handle the case where a CQ was
	 * freed and then allocated again in the time it took to
	 * handle the event queue processing.  By constantly incrementing
	 * the non-constrained portion of the CQ number every time
	 * a new CQ is allocated, we mitigate (somewhat) the chance
	 * that a stale event could be passed to the client's CQ
	 * handler.
	 *
	 * Lastly, we check if "hs_ibtfpriv" is NULL.  If it is then it
	 * means that we've have either received this event before we
	 * finished attaching to the IBTF or we've received it while we
	 * are in the process of detaching.
	 */
	if ((cq != NULL) && (cq->cq_cqnum == cqnum) &&
	    (state->hs_ibtfpriv != NULL)) {
		mcxnex_arm_cq_dbr_update(cq->cq_arm_ci_vdbr);
		MCXNEX_DO_IBTF_CQ_CALLB(state, cq);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_cq_err_handler()
 *    Context: Only called from interrupt context
 */
int
mcxnex_cq_err_handler(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe)
{
	mcxnex_cqhdl_t		cq;
	uint_t			cqnum;
	ibc_async_event_t	event;
	ibt_async_code_t	type;
	uint_t			eqe_evttype;

	eqe_evttype = MCXNEX_EQE_EVTTYPE_GET(eq, eqe);


	ASSERT(eqe_evttype == MCXNEX_EVT_CQ_ERRORS ||
	    eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW);

	if (eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW) {
		mcxnex_eq_overflow_handler(state, eq, eqe);
		return (DDI_FAILURE);
	}

	MCXNEX_FMANOTE(state, MCXNEX_FMA_OVERRUN);
	/* Get the CQ handle from CQ number in event descriptor */
	cqnum = MCXNEX_EQE_CQNUM_GET(eq, eqe);
	cq = mcxnex_cqhdl_from_cqnum(state, cqnum);

	/*
	 * If the CQ handle is NULL, this is probably an indication
	 * that the CQ has been freed already.  In which case, we
	 * should not deliver this event.
	 *
	 * We also check that the CQ number in the handle is the
	 * same as the CQ number in the event queue entry.  This
	 * extra check allows us to handle the case where a CQ was
	 * freed and then allocated again in the time it took to
	 * handle the event queue processing.  By constantly incrementing
	 * the non-constrained portion of the CQ number every time
	 * a new CQ is allocated, we mitigate (somewhat) the chance
	 * that a stale event could be passed to the client's CQ
	 * handler.
	 *
	 * And then we check if "hs_ibtfpriv" is NULL.  If it is then it
	 * means that we've have either received this event before we
	 * finished attaching to the IBTF or we've received it while we
	 * are in the process of detaching.
	 */
	if ((cq != NULL) && (cq->cq_cqnum == cqnum) &&
	    (state->hs_ibtfpriv != NULL)) {
		event.ev_cq_hdl = (ibt_cq_hdl_t)cq->cq_hdlrarg;
		type		= IBT_ERROR_CQ;
		MCXNEX_DO_IBTF_ASYNC_CALLB(state, type, &event);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_cq_refcnt_inc()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_cq_refcnt_inc(mcxnex_cqhdl_t cq, uint_t is_special)
{
	/*
	 * Increment the completion queue's reference count.  Note: In order
	 * to ensure compliance with IBA C11-15, we must ensure that a given
	 * CQ is not used for both special (SMI/GSI) QP and non-special QP.
	 * This is accomplished here by keeping track of how the referenced
	 * CQ is being used.
	 */
	mutex_enter(&cq->cq_lock);
	if (cq->cq_refcnt == 0) {
		cq->cq_is_special = is_special;
	} else {
		if (cq->cq_is_special != is_special) {
			mutex_exit(&cq->cq_lock);
			return (DDI_FAILURE);
		}
	}
	cq->cq_refcnt++;
	mutex_exit(&cq->cq_lock);
	return (DDI_SUCCESS);
}


/*
 * mcxnex_cq_refcnt_dec()
 *    Context: Can be called from interrupt or base context.
 */
void
mcxnex_cq_refcnt_dec(mcxnex_cqhdl_t cq)
{
	/* Decrement the completion queue's reference count */
	mutex_enter(&cq->cq_lock);
	cq->cq_refcnt--;
	mutex_exit(&cq->cq_lock);
}


