Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cq.c
/*
 * mcxnex_cq_arm_doorbell()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_cq_arm_doorbell(mcxnex_state_t *state, mcxnex_cqhdl_t cq, uint_t cq_cmd)
{
	uint32_t	cq_num;
	uint32_t	*target;
	uint32_t	old_cmd, cmp, new, tmp, cmd_sn;
	ddi_acc_handle_t uarhdl = mcxnex_get_uarhdl(state);

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test_num);

	cq_num = cq->cq_cqnum;
	target = (uint32_t *)cq->cq_arm_ci_vdbr + 1;

	/* the FMA retry loop starts for Mcxnex doorbell register. */
	mcxnex_pio_start(state, uarhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test_num);
retry:
	cmp = *target;
	tmp = htonl(cmp);
	old_cmd = tmp & (0x7 << MCXNEX_CQDB_CMD_SHIFT);
	cmd_sn = tmp & (0x3 << MCXNEX_CQDB_CMDSN_SHIFT);
	if (cq_cmd == MCXNEX_CQDB_NOTIFY_CQ) {
		if (old_cmd != MCXNEX_CQDB_NOTIFY_CQ) {
			cmd_sn |= (MCXNEX_CQDB_NOTIFY_CQ <<
			    MCXNEX_CQDB_CMD_SHIFT);
			new = htonl(cmd_sn | (cq->cq_consindx & 0xFFFFFF));
			tmp = atomic_cas_32(target, cmp, new);
			if (tmp != cmp)
				goto retry;
			MCXNEX_UAR_DOORBELL(state, uarhdl, (uint64_t *)(void *)
			    &state->hs_uar->cq, (((uint64_t)cmd_sn | cq_num) <<
			    32) | (cq->cq_consindx & 0xFFFFFF));
		} /* else it's already armed */
	} else {
		ASSERT(cq_cmd == MCXNEX_CQDB_NOTIFY_CQ_SOLICIT);
		if (old_cmd != MCXNEX_CQDB_NOTIFY_CQ &&
		    old_cmd != MCXNEX_CQDB_NOTIFY_CQ_SOLICIT) {
			cmd_sn |= (MCXNEX_CQDB_NOTIFY_CQ_SOLICIT <<
			    MCXNEX_CQDB_CMD_SHIFT);
			new = htonl(cmd_sn | (cq->cq_consindx & 0xFFFFFF));
			tmp = atomic_cas_32(target, cmp, new);
			if (tmp != cmp)
				goto retry;
			MCXNEX_UAR_DOORBELL(state, uarhdl, (uint64_t *)(void *)
			    &state->hs_uar->cq, (((uint64_t)cmd_sn | cq_num) <<
			    32) | (cq->cq_consindx & 0xFFFFFF));
		} /* else it's already armed */
	}

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, uarhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test_num);

	return (IBT_SUCCESS);

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
	return (DDI_FAILURE);
}


/*
 * mcxnex_cqhdl_from_cqnum()
 *    Context: Can be called from interrupt or base context.
 *
 *    This routine is important because changing the unconstrained
 *    portion of the CQ number is critical to the detection of a
 *    potential race condition in the CQ handler code (i.e. the case
 *    where a CQ is freed and alloc'd again before an event for the
 *    "old" CQ can be handled).
 *
 *    While this is not a perfect solution (not sure that one exists)
 *    it does help to mitigate the chance that this race condition will
 *    cause us to deliver a "stale" event to the new CQ owner.  Note:
 *    this solution does not scale well because the number of constrained
 *    bits increases (and, hence, the number of unconstrained bits
 *    decreases) as the number of supported CQs grows.  For small and
 *    intermediate values, it should hopefully provide sufficient
 *    protection.
 */
mcxnex_cqhdl_t
mcxnex_cqhdl_from_cqnum(mcxnex_state_t *state, uint_t cqnum)
{
	uint_t	cqindx, cqmask;

	/* Calculate the CQ table index from the cqnum */
	cqmask = (1 << state->hs_cfg_profile->cp_log_num_cq) - 1;
	cqindx = cqnum & cqmask;
	return (state->hs_cqhdl[cqindx]);
}

/*
 * mcxnex_cq_cqe_consume()
 *    Context: Can be called from interrupt or base context.
 */
static void
mcxnex_cq_cqe_consume(mcxnex_state_t *state, mcxnex_cqhdl_t cq,
    mcxnex_hw_cqe_t *cqe, ibt_wc_t *wc)
{
	uint_t		opcode, qpnum, qp1_indx;
	ibt_wc_flags_t	flags;
	ibt_wrc_opcode_t type;

	/*
	 * Determine if this is an "error" CQE by examining "opcode".  If it
	 * is an error CQE, then call mcxnex_cq_errcqe_consume() and return
	 * whatever status it returns.  Otherwise, this is a successful
	 * completion.
	 */
	opcode = MCXNEX_CQE_OPCODE_GET(cq, cqe);
	if ((opcode == MCXNEX_CQE_SEND_ERR_OPCODE) ||
	    (opcode == MCXNEX_CQE_RECV_ERR_OPCODE)) {
		mcxnex_cq_errcqe_consume(state, cq, cqe, wc);
		return;
	}

	/*
	 * Fetch the Work Request ID using the information in the CQE.
	 * See mcxnex_wr.c for more details.
	 */
	wc->wc_id = mcxnex_wrid_get_entry(cq, cqe);

	/*
	 * Parse the CQE opcode to determine completion type.  This will set
	 * not only the type of the completion, but also any flags that might
	 * be associated with it (e.g. whether immediate data is present).
	 */
	flags = IBT_WC_NO_FLAGS;
	if (MCXNEX_CQE_SENDRECV_GET(cq, cqe) != MCXNEX_COMPLETION_RECV) {

		/* Send CQE */
		switch (opcode) {
		case MCXNEX_CQE_SND_RDMAWR_IMM:
			flags |= IBT_WC_IMMED_DATA_PRESENT;
			/* FALLTHROUGH */
		case MCXNEX_CQE_SND_RDMAWR:
			type = IBT_WRC_RDMAW;
			break;

		case MCXNEX_CQE_SND_SEND_IMM:
			flags |= IBT_WC_IMMED_DATA_PRESENT;
			/* FALLTHROUGH */
		case MCXNEX_CQE_SND_SEND:
			type = IBT_WRC_SEND;
			break;

		case MCXNEX_CQE_SND_LSO:
			type = IBT_WRC_SEND_LSO;
			break;

		case MCXNEX_CQE_SND_RDMARD:
			type = IBT_WRC_RDMAR;
			break;

		case MCXNEX_CQE_SND_ATOMIC_CS:
			type = IBT_WRC_CSWAP;
			break;

		case MCXNEX_CQE_SND_ATOMIC_FA:
			type = IBT_WRC_FADD;
			break;

		case MCXNEX_CQE_SND_BIND_MW:
			type = IBT_WRC_BIND;
			break;

		default:
			MCXNEX_WARNING(state, "unknown send CQE type");
			wc->wc_status = IBT_WC_LOCAL_QP_OP_ERR;
			return;
		}
	} else {

		/* Receive CQE */
		switch (opcode & 0x1F) {
		/* for sendonly w/imm or sendlast w/imm */
		case MCXNEX_CQE_RCV_SEND_IMM:
			/*
			 * Note:  According to the PRM, all QP1 recv
			 * completions look like the result of a Send with
			 * Immediate.  They are not, however, (MADs are Send
			 * Only) so we need to check the QP number and set
			 * the flag only if it is non-QP1.
			 */
			qpnum	 = MCXNEX_CQE_QPNUM_GET(cq, cqe);
			qp1_indx = state->hs_spec_qp1->hr_indx;
			if ((qpnum < qp1_indx) || (qpnum > qp1_indx + 1)) {
				flags |= IBT_WC_IMMED_DATA_PRESENT;
			}
			/* FALLTHROUGH */
		/* for sendonly or sendlast */
		case MCXNEX_CQE_RCV_SEND:
			type = IBT_WRC_RECV;
			wc->wc_vlanid = 0;
			if (MCXNEX_CQE_IS_VLAN(cq, cqe)) {
				wc->wc_vlanid = MCXNEX_CQE_VLANID(cq, cqe);
			}

			if (MCXNEX_CQE_IS_IPOK(cq, cqe)) {
				wc->wc_cksum = MCXNEX_CQE_CKSUM(cq, cqe);
				flags |= IBT_WC_CKSUM_OK;
				if (MCXNEX_CQE_IS_TCPUDP(cq, cqe))
					flags |= IBT_WC_CKSUM_TCP_UDP_OK;
				wc->wc_detail = IBT_WC_DETAIL_ALL_FLAGS_MASK &
				    MCXNEX_CQE_IPOIB_STATUS(cq, cqe);
			}
			break;
		/* for RDMAwrite only or RDMAwrite last w/imm */
		case MCXNEX_CQE_RCV_RDMAWR_IMM:
			flags |= IBT_WC_IMMED_DATA_PRESENT;
			type = IBT_WRC_RECV_RDMAWI;
			break;

		default:
		/* still don't support send/invalidate, need to add later */

			MCXNEX_WARNING(state, "unknown recv CQE type");
			wc->wc_status = IBT_WC_LOCAL_QP_OP_ERR;
			return;
		}
	}
	wc->wc_type = type;

