Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cq.c
	/*
	 * Check for GRH, update the flags, then fill in "wc_flags" field
	 * in the work completion
	 */
	if (MCXNEX_CQE_GRH_GET(cq, cqe) != 0) {
		flags |= IBT_WC_GRH_PRESENT;
	}
	wc->wc_flags = flags;

	/* If we got here, completion status must be success */
	wc->wc_status = IBT_WC_SUCCESS;

	/*
	 * Parse the remaining contents of the CQE into the work completion.
	 * This means filling in SL, QP number, SLID, immediate data, etc.
	 * Note:  Not all of these fields are valid in a given completion.
	 * Many of them depend on the actual type of completion.  So we fill
	 * in all of the fields and leave it up to the IBTF and consumer to
	 * sort out which are valid based on their context.
	 */
	wc->wc_sl	  = MCXNEX_CQE_SL_GET(cq, cqe);
	wc->wc_immed_data = MCXNEX_CQE_IMM_ETH_PKEY_CRED_GET(cq, cqe);
	wc->wc_qpn	  = MCXNEX_CQE_DQPN_GET(cq, cqe);
	wc->wc_slid	  = MCXNEX_CQE_DLID_GET(cq, cqe);
	wc->wc_ethertype  = (wc->wc_immed_data & 0xFFFF);
	wc->wc_pkey_ix	  = (wc->wc_immed_data &
	    ((1 << state->hs_queryport.log_max_pkey) - 1));
	/*
	 * Depending on whether the completion was a receive or a send
	 * completion, fill in "bytes transferred" as appropriate.  Also,
	 * if necessary, fill in the "path bits" field.
	 */
	if (MCXNEX_CQE_SENDRECV_GET(cq, cqe) == MCXNEX_COMPLETION_RECV) {
		wc->wc_path_bits = MCXNEX_CQE_PATHBITS_GET(cq, cqe);
		wc->wc_bytes_xfer = MCXNEX_CQE_BYTECNT_GET(cq, cqe);

	} else if ((wc->wc_type == IBT_WRC_RDMAR) ||
	    (wc->wc_type == IBT_WRC_CSWAP) || (wc->wc_type == IBT_WRC_FADD)) {
		wc->wc_bytes_xfer = MCXNEX_CQE_BYTECNT_GET(cq, cqe);
	}
}

/*
 * mcxnex_cq_errcqe_consume()
 *    Context: Can be called from interrupt or base context.
 */
static void
mcxnex_cq_errcqe_consume(mcxnex_state_t *state, mcxnex_cqhdl_t cq,
    mcxnex_hw_cqe_t *cqe, ibt_wc_t *wc)
{
	uint32_t		imm_eth_pkey_cred;
	uint_t			status;
	ibt_wc_status_t		ibt_status;

	/*
	 * Fetch the Work Request ID using the information in the CQE.
	 * See mcxnex_wr.c for more details.
	 */
	wc->wc_id = mcxnex_wrid_get_entry(cq, cqe);

	/*
	 * Parse the CQE opcode to determine completion type.  We know that
	 * the CQE is an error completion, so we extract only the completion
	 * status/syndrome here.
	 */
	imm_eth_pkey_cred = MCXNEX_CQE_ERROR_SYNDROME_GET(cq, cqe);
	status = imm_eth_pkey_cred;
	switch (status) {
	case MCXNEX_CQE_LOC_LEN_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_LOCLEN);
		ibt_status = IBT_WC_LOCAL_LEN_ERR;
		break;

	case MCXNEX_CQE_LOC_OP_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_LOCQPOP);
		ibt_status = IBT_WC_LOCAL_QP_OP_ERR;
		break;

	case MCXNEX_CQE_LOC_PROT_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_LOCPROT);
		ibt_status = IBT_WC_LOCAL_PROTECT_ERR;
		if (mcxnex_should_panic) {
			cmn_err(CE_PANIC, "Local Protection Error");
		}
		break;

	case MCXNEX_CQE_WR_FLUSHED_ERR:
		ibt_status = IBT_WC_WR_FLUSHED_ERR;
		break;

	case MCXNEX_CQE_MW_BIND_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_MWBIND);
		ibt_status = IBT_WC_MEM_WIN_BIND_ERR;
		break;

	case MCXNEX_CQE_BAD_RESPONSE_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_RESP);
		ibt_status = IBT_WC_BAD_RESPONSE_ERR;
		break;

	case MCXNEX_CQE_LOCAL_ACCESS_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_LOCACC);
		ibt_status = IBT_WC_LOCAL_ACCESS_ERR;
		break;

	case MCXNEX_CQE_REM_INV_REQ_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_REMREQ);
		ibt_status = IBT_WC_REMOTE_INVALID_REQ_ERR;
		break;

	case MCXNEX_CQE_REM_ACC_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_REMACC);
		ibt_status = IBT_WC_REMOTE_ACCESS_ERR;
		break;

	case MCXNEX_CQE_REM_OP_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_REMOP);
		ibt_status = IBT_WC_REMOTE_OP_ERR;
		break;

	case MCXNEX_CQE_TRANS_TO_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_XPORTCNT);
		ibt_status = IBT_WC_TRANS_TIMEOUT_ERR;
		break;

	case MCXNEX_CQE_RNRNAK_TO_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_RNRCNT);
		ibt_status = IBT_WC_RNR_NAK_TIMEOUT_ERR;
		break;

	/*
	 * The following error codes are not supported in the Mcxnex driver
	 * as they relate only to Reliable Datagram completion statuses:
	 *    case MCXNEX_CQE_LOCAL_RDD_VIO_ERR:
	 *    case MCXNEX_CQE_REM_INV_RD_REQ_ERR:
	 *    case MCXNEX_CQE_EEC_REM_ABORTED_ERR:
	 *    case MCXNEX_CQE_INV_EEC_NUM_ERR:
	 *    case MCXNEX_CQE_INV_EEC_STATE_ERR:
	 *    case MCXNEX_CQE_LOC_EEC_ERR:
	 */

	default:
		MCXNEX_WARNING(state, "unknown error CQE status");
		MCXNEX_FMANOTE(state, MCXNEX_FMA_UNKN);
		ibt_status = IBT_WC_LOCAL_QP_OP_ERR;
		break;
	}

	wc->wc_status = ibt_status;
}


/*
 * mcxnex_cqe_sync()
 *    Context: Can be called from interrupt or base context.
 */
static void
mcxnex_cqe_sync(mcxnex_cqhdl_t cq, mcxnex_hw_cqe_t *cqe, uint_t flag)
{
	ddi_dma_handle_t	dmahdl;
	off_t			offset;
	int			status;

	/* Get the DMA handle from CQ context */
	dmahdl = cq->cq_mrhdl->mr_bindinfo.bi_dmahdl;

	/* Calculate offset of next CQE */
	offset = (off_t)((uintptr_t)cqe - (uintptr_t)&cq->cq_buf[0]);
	status = ddi_dma_sync(dmahdl, offset, sizeof (mcxnex_hw_cqe_t), flag);
	if (status != DDI_SUCCESS) {
		return;
	}
}


/*
 * mcxnex_cq_resize_helper()
 *    Context: Can be called only from user or kernel context.
 */
void
mcxnex_cq_resize_helper(mcxnex_state_t *state, mcxnex_cqhdl_t cq)
{
	mcxnex_cqhdl_t 		resize_hdl;
	int			status;

	/*
	 * we're here because we found the special cqe opcode, so we have
	 * to update the cq_handle, release the old resources, clear the
	 * flag in the cq_hdl, and release the resize_hdl.  When we return
	 * above, it will take care of the rest
	 */
	ASSERT(MUTEX_HELD(&cq->cq_lock));

	resize_hdl = cq->cq_resize_hdl;

	/*
	 * Deregister the memory for the old Completion Queue.  Note: We
	 * really can't return error here because we have no good way to
	 * cleanup.  Plus, the deregistration really shouldn't ever happen.
	 * So, if it does, it is an indication that something has gone
	 * seriously wrong.  So we print a warning message and return error
	 * (knowing, of course, that the "old" CQ memory will be leaked)
	 */
	status = mcxnex_mr_deregister(state, &cq->cq_mrhdl, MCXNEX_MR_DEREG_ALL,
	    DDI_SLEEP);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to deregister old CQ memory");
	}

