Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cq.c
	/* Next, free the memory from the old CQ buffer */
	mcxnex_queue_free(&cq->cq_cqinfo);

	/* now we can update the cq_hdl with the new things saved */

	cq->cq_buf   = resize_hdl->cq_buf;
	cq->cq_mrhdl = resize_hdl->cq_mrhdl;
	cq->cq_bufsz = resize_hdl->cq_bufsz;
	cq->cq_log_cqsz = resize_hdl->cq_log_cqsz;
	cq->cq_umap_dhp = cq->cq_resize_hdl->cq_umap_dhp;
	cq->cq_resize_hdl = 0;
	bcopy(&resize_hdl->cq_cqinfo, &cq->cq_cqinfo,
	    sizeof (struct mcxnex_qalloc_info_s));

	/* finally, release the resizing handle */
	kmem_free(resize_hdl, sizeof (struct mcxnex_sw_cq_s));
}


/*
 * mcxnex_cq_entries_flush()
 * Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
void
mcxnex_cq_entries_flush(mcxnex_state_t *state, mcxnex_qphdl_t qp)
{
	mcxnex_cqhdl_t		cq;
	mcxnex_hw_cqe_t		*cqe, *next_cqe;
	mcxnex_srqhdl_t		srq;
	mcxnex_workq_hdr_t	*wq;
	uint32_t		cons_indx, tail_cons_indx, wrap_around_mask;
	uint32_t		new_indx, check_indx, qpnum;
	int			outstanding_cqes;

	qpnum = qp->qp_qpnum;
	if ((srq = qp->qp_srqhdl) != NULL)
		wq = qp->qp_srqhdl->srq_wq_wqhdr;
	else
		wq = NULL;
	cq = qp->qp_rq_cqhdl;

do_send_cq:	/* loop back to here if send_cq is not the same as recv_cq */

	cons_indx = cq->cq_consindx;
	wrap_around_mask = (cq->cq_bufsz - 1);

	/* Calculate the pointer to the first CQ entry */
	cqe = &cq->cq_buf[cons_indx & wrap_around_mask];

	/* Sync the current CQE to read */
	mcxnex_cqe_sync(cq, cqe, DDI_DMA_SYNC_FORCPU);

	/*
	 * Loop through the CQ looking for entries owned by software.  If an
	 * entry is owned by software then we increment an 'outstanding_cqes'
	 * count to know how many entries total we have on our CQ.  We use this
	 * value further down to know how many entries to loop through looking
	 * for our same QP number.
	 */
	outstanding_cqes = 0;
	tail_cons_indx = cons_indx;
	while (MCXNEX_CQE_OWNER_IS_SW(cq, cqe, tail_cons_indx)) {
		/* increment total cqes count */
		outstanding_cqes++;

		/* increment the consumer index */
		tail_cons_indx++;

		/* update the pointer to the next cq entry */
		cqe = &cq->cq_buf[tail_cons_indx & wrap_around_mask];

		/* sync the next cqe to read */
		mcxnex_cqe_sync(cq, cqe, DDI_DMA_SYNC_FORCPU);
	}

	/*
	 * Using the 'tail_cons_indx' that was just set, we now know how many
	 * total CQEs possible there are.  Set the 'check_indx' and the
	 * 'new_indx' to the last entry identified by 'tail_cons_indx'
	 */
	check_indx = new_indx = (tail_cons_indx - 1);

	while (--outstanding_cqes >= 0) {
		cqe = &cq->cq_buf[check_indx & wrap_around_mask];

		/*
		 * If the QP number is the same in the CQE as the QP, then
		 * we must "consume" it.  If it is for an SRQ wqe, then we
		 * also must free the wqe back onto the free list of the SRQ.
		 */
		if (qpnum == MCXNEX_CQE_QPNUM_GET(cq, cqe)) {
			if (srq && (MCXNEX_CQE_SENDRECV_GET(cq, cqe) ==
			    MCXNEX_COMPLETION_RECV)) {
				uint64_t *desc;
				int indx;

				/* Add wqe back to SRQ free list */
				indx = MCXNEX_CQE_WQEADDRSZ_GET(cq, cqe) &
				    wq->wq_mask;
				desc = MCXNEX_SRQ_WQE_ADDR(srq, wq->wq_tail);
				((uint16_t *)desc)[1] = htons(indx);
				wq->wq_tail = indx;
			}
		} else {	/* CQEs for other QPNs need to remain */
			if (check_indx != new_indx) {
				next_cqe =
				    &cq->cq_buf[new_indx & wrap_around_mask];
				/* Copy the CQE into the "next_cqe" pointer. */
				bcopy(cqe, next_cqe, sizeof (mcxnex_hw_cqe_t));
			}
			new_indx--;	/* move index to next CQE to fill */
		}
		check_indx--;		/* move index to next CQE to check */
	}

	/*
	 * Update consumer index to be the 'new_indx'.  This moves it past all
	 * removed entries.  Because 'new_indx' is pointing to the last
	 * previously valid SW owned entry, we add 1 to point the cons_indx to
	 * the first HW owned entry.
	 */
	cons_indx = (new_indx + 1);

	/*
	 * Now we only ring the doorbell (to update the consumer index) if
	 * we've actually consumed a CQ entry.  If we found no QP number
	 * matches above, then we would not have removed anything.  So only if
	 * something was removed do we ring the doorbell.
	 */
	if (cq->cq_consindx != cons_indx) {
		/*
		 * Update the consumer index in both the CQ handle and the
		 * doorbell record.
		 */
		cq->cq_consindx = cons_indx;

		mcxnex_cq_update_ci_doorbell(cq);

	}
	if (cq != qp->qp_sq_cqhdl) {
		cq = qp->qp_sq_cqhdl;
		goto do_send_cq;
	}
}


void
mcxnex_priv_cq_handler(mcxnex_state_t *state, mcxnex_cqhdl_t cq_hdl)
{
	mcxnex_priv_cq_cb_t  cb;
	void		    *cb_arg;

	cb = cq_hdl->cq_priv_cb;
	cb_arg = cq_hdl->cq_priv_cb_arg;

	if (cb != NULL)
		cb(state, cq_hdl, cb_arg);

	/* for IB driver, need to call ibc_cq_handler() */
}

/*ARGSUSED*/
void
mcxnex_priv_cq_set_handler(mcxnex_state_t *state, mcxnex_cqhdl_t cq_hdl,
    mcxnex_priv_cq_cb_t cq_cb, void *cq_cb_arg)
{
	cq_hdl->cq_priv_cb = cq_cb;
	cq_hdl->cq_priv_cb_arg = cq_cb_arg;
}
